app/controllers/registration_controller.rb

  def create
      @member = Member.new
      @member.username = params[:member][:username]
      @member.email = params[:member][:email]
      @member.password = params[:member][:password]
      @member.password_confirmation =params[:member][:password_confirmation]

      @contact = Contact.new
      @contact.mobile = params[:contact][:mobile]
      @contact.address = params[:contact][:address]
      @member.valid?

      if @member.errors.blank?
        @member.save
        @contact.member = @member
        @contact.save
---
SELECT 1 AS one FROM `members` WHERE `members`.`email` = BINARY 'karim@kamana.com' LIMIT 1
INSERT INTO `members` (`created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `last_sign_in_at`, `last_sign_in_ip`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `sign_in_count`, `updated_at`, `username`) VALUES ('2013-07-22 08:59:57', NULL, NULL, 'karim@kamana.com', '$2a$10$wEWpjfTvWm7citPMUMAXA.yRFVwinyua4dsDVJXHynhPvOOrhMle6', NULL, NULL, NULL, NULL, NULL, 0, '2013-07-22 08:59:57', 'karim')
INSERT INTO `contacts` (`address`, `email`, `encrypted_password`, `member_id`, `mobile`) VALUES ('butki', '', '', 2, '08078567198')